---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowMultipleRowsForMultiphaseCircuits
source: html/4ccaca7c-243a-4264-5703-868836f13d6f.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowMultipleRowsForMultiphaseCircuits Property

shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise

## Syntax (C#)
```csharp
public bool ShowMultipleRowsForMultiphaseCircuits { get; set; }
```

## Remarks
only applicable to one column formats